res/cf/Catalogs/ИнформационныеБазы1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_ИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПриложений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыПриложений1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверБазДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыБазДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторизационныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МенеджерПаролей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольНаПроекте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РолиНаПроекте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Catalogs/ИнформационныеБазы1С/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыИБ(База) Экспорт
	ПараметрыИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ПараметрыИБ.ИмяВКластере = База.Наименование;
	ПараметрыИБ.ИмяАдминистратораИнформационнойБазы = База.АвторизационныеДанные.Логин;
	ПараметрыИБ.ПарольАдминистратораИнформационнойБазы = База.АвторизационныеДанные.Пароль;
	
	Возврат  ПараметрыИБ;
	
КонецФункции

Функция БазаСуществует(ИмяИБ, Ссылка, ЭтоНовый) Экспорт

	СтароеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Наименование");
	Если ЭтоНовый ИЛИ (СтароеНаименование <> ИмяИБ) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИнформационныеБазы1С.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ИнформационныеБазы1С КАК ИнформационныеБазы1С
			|ГДЕ
			|	ИнформационныеБазы1С.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", ИмяИБ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Возврат НЕ РезультатЗапроса.Пустой();
	Иначе
		Возврат Ложь;
	КонеЦесли;
	
КонецФункции

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|  ЭтоАвторизованныйПользователь(Пользователь)
	|  ИЛИ(ЗначениеРазрешено(Контур, ПустаяСсылка КАК Истина) И ЧтениеОбъектаРазрешено(Проект))
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|    ЭтоАвторизованныйПользователь(Пользователь)
	|";

КонецПроцедуры
